/*╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺
    ＰＲＯＪＥＣＴ ＮＡＭＥ:

 🤍✨𝐂 𝐘 𝐁 𝐄 𝐑-𝐑 𝐀 𝐉 𝐈 𝐁✨🤍 
╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺*/

function _0x51663d(_0x3d020b, _0x29da43, _0x46f2bf, _0x1ea47d, _0xb3d1f4) {
  return _0x5d51(_0x1ea47d - 0x157, _0x3d020b);
}
(function (_0x11fd60, _0x135098) {
  const _0x25567e = _0x11fd60();
  while (true) {
    try {
      const _0x48014d = -parseInt(_0x5d51(378, 0x4ab)) / 1 + -parseInt(_0x5d51(584, 0x699)) / 2 + -parseInt(_0x5d51(648, 0x6b2)) / 3 + -parseInt(_0x5d51(467, 0x261)) / 4 + parseInt(_0x5d51(507, 0x571)) / 5 + parseInt(_0x5d51(575, 0x697)) / 6 * (parseInt(_0x5d51(386, 0x15c)) / 7) + parseInt(_0x5d51(440, 0x20f)) / 8;
      if (_0x48014d === _0x135098) {
        break;
      } else {
        _0x25567e.push(_0x25567e.shift());
      }
    } catch (_0x5b28fd) {
      _0x25567e.push(_0x25567e.shift());
    }
  }
})(_0x5bfb, 294774);
function hi() {
  const _0x1248b9 = function () {
    let _0x585abc = true;
    return function (_0xb58301, _0x592f5a) {
      const _0x3b136d = _0x585abc ? function () {
        if (_0x592f5a) {
          const _0x54b484 = _0x592f5a.apply(_0xb58301, arguments);
          _0x592f5a = null;
          return _0x54b484;
        }
      } : function () {};
      _0x585abc = false;
      return _0x3b136d;
    };
  }();
  const _0x559718 = _0x1248b9(this, function () {
    return _0x559718.toString().search("(((.+)+)+)+$").toString().constructor(_0x559718).search("(((.+)+)+)+$");
  });
  _0x559718();
  const _0x439b6b = function () {
    let _0x39eeb8 = true;
    return function (_0x4cc52b, _0x539be7) {
      const _0x4febd5 = _0x39eeb8 ? function () {
        if (_0x539be7) {
          const _0x33970e = _0x539be7.apply(_0x4cc52b, arguments);
          _0x539be7 = null;
          return _0x33970e;
        }
      } : function () {};
      _0x39eeb8 = false;
      return _0x4febd5;
    };
  }();
  (function () {
    _0x439b6b(this, function () {
      const _0x2e2523 = new RegExp("function *\\( *\\)");
      const _0x34ce77 = new RegExp("\\+\\+ *(?:[a-zA-Z_$][0-9a-zA-Z_$]*)", 'i');
      const _0x2b2ffe = _0x15590f("init");
      if (!_0x2e2523.test(_0x2b2ffe + "chain") || !_0x34ce77.test(_0x2b2ffe + "input")) {
        _0x2b2ffe('0');
      } else {
        _0x15590f();
      }
    })();
  })();
  const _0x3c7c48 = function () {
    let _0x35369d = true;
    return function (_0x553040, _0x3b299c) {
      const _0x133217 = _0x35369d ? function () {
        if (_0x3b299c) {
          const _0x187d6b = _0x3b299c.apply(_0x553040, arguments);
          _0x3b299c = null;
          return _0x187d6b;
        }
      } : function () {};
      _0x35369d = false;
      return _0x133217;
    };
  }();
  const _0x2becf2 = _0x3c7c48(this, function () {
    const _0x123019 = function () {
      let _0x541330;
      try {
        _0x541330 = Function("return (function() {}.constructor(\"return this\")( ));")();
      } catch (_0x4357aa) {
        _0x541330 = window;
      }
      return _0x541330;
    };
    const _0x184ca6 = _0x123019();
    const _0x447a61 = _0x184ca6.console = _0x184ca6.console || {};
    const _0x4b1b0c = ["log", "warn", "info", "error", "exception", "table", "trace"];
    for (let _0x403e6d = 0; _0x403e6d < _0x4b1b0c.length; _0x403e6d++) {
      const _0xfbf926 = _0x3c7c48.constructor.prototype.bind(_0x3c7c48);
      const _0x23b172 = _0x4b1b0c[_0x403e6d];
      const _0x180596 = _0x447a61[_0x23b172] || _0xfbf926;
      _0xfbf926.__proto__ = _0x3c7c48.bind(_0x3c7c48);
      _0xfbf926.toString = _0x180596.toString.bind(_0x180596);
      _0x447a61[_0x23b172] = _0xfbf926;
    }
  });
  _0x2becf2();
  console.log("Hello World!");
}
hi();
const config = require("../config");
const {
  cmd,
  commands
} = require("../command");
const {
  runtime
} = require("../lib/functions");
function _0x5e5400(_0x48f953, _0x7fdb87, _0x2ad3c8, _0x2ed41b, _0x28ced5) {
  return _0x5d51(_0x48f953 + 0x21d, _0x28ced5);
}
const _0x30971e = {};
function _0x4da31e(_0x5d52b8, _0x5001e2, _0x31a054, _0x8c1f77, _0x5a21ff) {
  return _0x5d51(_0x5d52b8 - 0x1a5, _0x5001e2);
}
function _0x5d51(_0x15590f, _0x33a214) {
  const _0x5b99b9 = _0x5bfb();
  _0x5d51 = function (_0x1e3ba2, _0x193e72) {
    _0x1e3ba2 = _0x1e3ba2 - 343;
    let _0x25890c = _0x5b99b9[_0x1e3ba2];
    return _0x25890c;
  };
  return _0x5d51(_0x15590f, _0x33a214);
}
_0x30971e.pattern = "menu";
function _0x5bfb() {
  const _0x31c9f6 = ['kKIpV', " *ᴍᴏᴅ", "ʀʟ*\n*", 'desc', 'ᴢᴇʀᴏɪ', 'posti', 'VThlo', " ⟣⟞\n┊", 'ɢᴘᴀꜱꜱ', 'HeySW', " *⟡ ɪ", 'ᴀᴍᴀ2*', 'Z_$][', "🏮* \n\n", 'axios', 'qGtCW', ')+)+)', "ᴠᴇ*\n*", 'ᴀɴɪᴍᴇ', "⟡ ssᴡ", 'tdVnU', 'cETxr', " *⟡ ᴜ", "*⟡ ᴄʟ", 'filen', 'ᴏɢʟᴇ*', 'ᴅᴇᴏ3*', "⟡ ꜰᴀᴄ", 'bind', 'TUNms', "ᴍᴅ*\n┊", 'MiKee', 'BCiSq', 'NFO-C', 'RUQJV', 'kaGTR', "*⟡ ʙᴏ", 'ame', 'ᴄʀᴇᴀᴛ', 'FBRnj', 'tccVt', '╶---◈', 'ᴇᴀᴠᴇ*', "--◈*\n", 'bzero', "ᴇᴀʀ 7", 'yqIPE', 'XGcQY', "ᴀᴛs*\n", 'MvWsB', '/main', 'gpiJv', 'Imrzo', '-CMD`', 'FcCRW', '/SUBZ', "rn th", 'FkTfx', 'P-CMD', 'edCkV', 'ᴅᴄᴀsᴛ', 'hfcQS', 'ᴘɪɴᴛᴇ', "ᴄᴋ*\n*", "*⟡ ᴛᴀ", 'zQuzR', 'round', 'ᴜᴘᴛɪᴍ', 'SQxaE', "\n*🏮 `", 'dmjat', "ʀᴇ*\n*", 'O-SET', 'ɢɪɴɪs', 'fKBes', "*⟡ ᴍᴇ", "*⟡ sᴜ", 'sᴜʙᴢᴇ', 'RS-CM', '`GROU', 'tterM', "DER` ", 'PCbTT', 'MODE', 'ɪᴍᴇɢɪ', "MD` 🏮", 'YHiYm', "--◈\n└", "*⟡ ʙᴀ", "ᴀᴄᴋ*\n", 'miEbS', " ʏᴛᴍᴘ", 'CTDZC', "⟡ ᴀɴᴛ", 'eNswb', 'bRkiu', 'ctor(', 'wfzdd', " ꜱᴛᴀᴛ", 'dnXvZ', 'apply', 'zYXBB', 'aCZUH', 'atHlV', "ɴᴄ*\n*", " *⟡ ʟ", "s*\n*┋", 'WGzua', 'ɢᴀʟʟ*', " `WAL", 'memor', 'etter', 'ᴍᴏᴠɪᴇ', 'yUsag', "ʀ*\n*┋", " sʜᴜᴛ", 'goAnz', "ʟ5*\n*", "ion *", " ᴡᴇᴀᴛ", 'ihNep', "*⟡ ᴍʀ", "` 🏮* ", "\n\n╭╺╺", 'ᴅᴇsᴄ*', 'ɪsᴀᴘᴘ', 'ɴɪᴍᴇɢ', "━━━*\n", 'PUgSt', "\n*━━━", 'UNxFM', 'AqpPg', "ɪғʏ*\n", '╺╺╺╺╺', '../li', 'beMod', 'KOFOx', 'ttARA', 'ʟᴀᴄᴋʙ', '─╶╶╶╶ ', "ᴇᴍ*\n*", 'ʀᴇsᴛ*', 'JlZWB', 'ᴡɴᴇʀ*', 'WFdTo', 'cLtYz', 'VQdSJ', 'rding', 'DHOdZ', 'ɴᴅᴅᴍ*', 'LPAPE', "ɢ*\n*┋", 'Xnlxv', '╰────', 'debu', 'MTpAY', " `OWN", "ɴɢ2*\n", 'ᴇɢɪʀʟ', 'D-DAT', 'UTixF', 'dcoMZ', 'jaUBV', 'iblvJ', " ʙʟᴏᴄ", 'M-CMD', 'BAUxG', 'yeYig', '-menu', '$]*)', " ʀᴇᴘᴏ", '080@n', 'JYFwM', "🏮* \n\n", 'b/fun', "` 🏮* ", 'lpJdx', "ɪᴇ*\n*", 'rdedN', 'Hello', "` 🏮* ", 'MGAia', "⟡ ᴅᴇꜰ", 'xRppR', "ᴜᴛᴇ*\n", '*(?:[', "⟡ ᴍᴇɴ", 'NeRXR', 'GebFI', 'AZznW', '12036', 'MtWJQ', 'AuPTL', "ʙ*\n*┋", '75241imUsbD', "ᴘᴘ*\n*", 'ᴠᴏᴋᴇ*', 'onedJ', "\n╭───", 'RtnEm', " ＳＵＢＺ", 'ᴜᴇsᴛs', '15659yrnDga', 'rQFw/', 'xtInf', " *⟡ ᴛ", 'ʀᴇᴘᴏ*', 'AME', 'oJIrm', "│✿ *ɴ", "ᴇɴᴠ*\n", 'BRxSw', 'tmyaT', 'retur', 'tgFsi', 'ᴛᴀᴛᴜꜱ', 'subze', 'XhDIQ', 'thmKj', "⟡ ᴅᴏɢ", 'xBqec', 'ɴɪᴍᴇ*', 'yFCgt', "ＥＲＯ -", 'ewsle', 'ɢsᴛɪᴄ', " ᴛᴡɪᴛ", 'rMess', 'wnznL', 'ᴀᴘᴘᴇᴀ', 'mdlIP', 'ɪᴄᴋᴇʀ', 'warn', 'zrkkt', 'ER-CM', 'xqWgI', "* *⟡ ", 'UrWdC', 'ZrexV', "ＢＯＴ\n\n", 'riuwB', 'jcWmz', "ᴏɴ* :", 'FyTKH', "CMD` ", 'ᴛɪɴɢs', 'rfran', "⟡ ᴀɴɪ", 'sIqXK', 'Jbdbe', 'xOYAF', '──╶╶·', 'UBZER', "ro me", 'com/m', 'ptt', '5541448kFhSgY', "ɪᴅ*\n*", 'BhAiw', "│\n│  ", " ɢᴘᴛ*", 'BLuzY', " (tru", 'hbmox', 'xezIC', 'toStr', "ᴢᴇʀᴏ ", 'pZnUi', "ᴘᴏ*\n*", 'BuZvB', 'zeZRM', 'ᴘɪʟᴏᴛ', '/audi', " *⟡ ꜱ", " ᴘʟᴀʏ", 'LKAYf', 'Score', 'PiztP', "ᴍɢ*\n*", "⟡ ᴘʀᴏ", "ᴛᴀɢ*\n", "╺╺◈\n┊", 'pnXGC', '2272252mingcO', 'NIpgl', 'KtLYE', '────·', "⟡ ᴜɴᴍ", "n() ", "ᴀᴍ* :", 'capti', 'acDiQ', "𝐙𝐄𝐑𝐎 ", 'SrgzD', "*⟡ ᴄᴏ", "*⟡ ɪᴍ", 'LKxSo', '/yNf7', 'dUKuj', " ᴘᴀɪʀ", 'ᴠɪᴛᴇ*', 'YrcIL', 'ᴍᴇɢɪʀ', 'dNUmL', 'ʀᴇғɪx', "ʀ ᴏғғ", 'NHOBl', '*╰───', "ᴇᴏ*\n*", 'mem', 'jabcH', " ᴅɪsᴀ", "ᴜ3*\n*", 'sendM', 'tion', 'chain', "ʏᴛᴀ*\n", 'ngkZq', 'kUBDK', 'ᴘɪɴɢ*', " ᴜᴘᴅᴀ", " ⛈️* \n", "* \n\n╭", '372475CGqAsa', "*⟡ ᴀᴅ", 'ciWXb', 'react', 'ᴠᴇʀsɪ', "⟡ sᴜʙ", 'aGzjX', '{}.co', '─────', 'AFUKV', "*\n\n*🏮", "]*\n┊➮", "ʙʟᴇ*\n", 'mSaAo', "🏮* \n\n", 'heads', " *⟡ ᴊ", "ɴᴋ*\n*", 'ction', 'RTER-', "4*\n*┋", 'OOBvT', "\n*╰──", " ╰───", 'iuFML', "RO DO", "ʏ2*\n*", "ᴛs*\n*", '───··', 'ᴘᴅᴀᴛᴇ', 'warde', 'ructo', 'zA-Z_', 'sed', " ᴏᴡɴᴇ", 'hqznV', 'ageId', "ᴀᴛᴇ*\n", "ꜱ*\n*┋", "ᴏx*\n*", 'ᴛᴡᴇʟᴄ', 'udueF', "\n\n*🏮 ", 'ʙᴏᴜᴛ*', 'JdGYE', 'ᴅᴀᴛᴇɢ', 'refs/', "╶╶╶◈\n", 'OWBKx', 'hcdxd', 'kJpvh', "ᴛᴀ*\n*", 'vwhaC', 'ylWlR', 'CNXxj', 'IwbOG', 'thub.', 'terva', "༆│✿ *", 'proto', 'YBxoq', 'ɪsɪʟᴀ', "*⟡ ʏᴛ", 'searc', '━*⁠⁠⁠', 'SHwZj', " sᴘᴏᴛ", 'gfzTY', '1446wLWlFn', 'https', 'quote', 'RANDO', "*⟡ ʙɪ", 'os/su', '../co', "ᴛ*\n*╰", "*⟡ ʟʟ", '725276ZyzngV', 'ory', 'VyRQU', "ᴇ*\n*┋", " ɢᴅʀɪ", " ᴏɴ*\n", "ɴᴜ2*\n", '__pro', "··◈\n*", 'nctio', 'while', 'ɪsᴄᴏᴘ', 'ERO-M', 'OHjCX', 'bIcdj', 'info', 'qoWPZ', 'ᴋɪᴄᴋ*', 'DZWaP', 'OTHER', 'mg.cc', " sᴛᴀʙ", 'kgvMA', 'kdmFu', 'ɢᴇᴍɪɴ', " *⟡ ᴅ", "𝐌𝐃 ⛈️", "*\n\n*🏮", "*🏮 `I", " *1.0", 'forwa', 'ᴘᴀᴘᴇʀ', 'ᴅᴇᴏ2*', 'ᴄᴋᴀʟʟ', 'BaRcJ', 'jwurU', 'Objec', "\n*┋* ", " *⟡ ʜ", 'ype', 'ʟɪᴠᴇ*', 'Zdwtm', "*┋* *", "ᴅ 24ʜ", "┊┴│\n┊", 'ɪᴅᴇᴏ*', 'WnJJI', 'EuZcS', 'PREFI', "D` 🏮*", "ᴏᴛ* :", 'saHxw', 'ᴛᴘɪᴄ*', " ғʙ*\n", "*⟡ ᴘɪ", "⁠\n> Ｍ", 'SlhkS', 'bgcdi', "ᴀᴍᴇ ʙ", "ᴋᴇʀ*\n", 'ʜᴇʀ*n', 'BOT_N', "*⟡ ᴜᴘ", '/raw/', '16731AlyCCy', 'image', 'call', " ɢᴊɪᴅ", "\"retu", 'url', 'ɪʀʟ3*', 'hOwij', 'H-CMD', 'vDXrz', 'xCeOs', "ᴏʀ* :", "ᴏɢᴏ*\n", 'nstru', 'lhHHY', 'ɢɪᴛʜᴜ', 'serve', " *⟡ ᴘ", 'input', 'tter', 'PkhYe', 'ɢɪʀʟ2', '*━━━━', 'lengt', "\n*🏮 `", "ᴄᴍᴅ*\n", "\n*🏮 `", 'SUBZE', 'HxqEG', 'YAJnp', " *⟡ ᴍ", "ʀʟ4*\n", 'essag', 'ɴᴀᴍᴇ*', 'mOnpp', 'vQONG', 'faseU', "D` 🏮*", "⟡ ᴜᴘᴅ", 'mgKht', 'CONVE', 'ᴍᴏᴛᴇ*', "·◈\n\n>", 'BOZhE', 'FbEcb', " (🇧🇩)*", 'ᴇᴛᴛɪɴ', "ᴘ3*\n*", 'xfVvT', "\n\n╭──", 'ᴜᴘᴘᴏʀ', " ᴀɴɪᴍ", 'conso', "MB\n┊༆", 'wqGkB', 'jRUrz', 'state', 'TACEA', 'heapU', 'WRbls', "\n┊༆│▸", 'ғᴜssɪ', "┋* *⟡", "⟡ ᴛᴛ*", 'eVEsL', 'vUCgR', "ᴏᴋᴇ*\n", 'fAEQo', 'count', 'ᴏᴄᴋɢᴄ', 'Gvmij', '─╶╶╶◈', 'pwnLj', "ɪ*\n*┋", "⟡ ᴅɪs", " \n\n╭─", "*\n*╰─", 'loXXK', 'JrlIR', 'PDFWF', 'rSufT', 'init', 'ᴇꜱᴛᴀʀ', "·◈*\n\n", "⟡ ᴠᴠ*", 'wXNXB', 'oZhje', " ꜱʏꜱᴛ", "3*\n*┋", 'vAJxC', 'Npqin', "*⟡ ᴀɪ", "ᴀᴘᴋ*\n", 'fdwHn', 'SEARC', " 90ᴅ*", 'KoLcq', "` 🏮* ", 'HkfVp', 'dyMaS', 'VZZZa', 'yZXvd', 'qUaqK', 'vKfBM', 'ɪᴠɪᴇᴡ', " *ᴍʀ ", 'heQTX', 'toFix', "\n┬   ", 'IEjvm', "ʟᴀʏ*\n", 'isFor', 'djmAE', 'Huchh', 'zrhxv', 'TECrg', "ᴏɴ*\n*", 'XcRBO', 'to__', "*⟡ ʀᴇ", "⟡ sᴇᴛ", 'test', 'ᴍʀғʀᴀ', 'swuyn', 'izDye', 'PphCU', 'zOiDo', 'ᴘᴘᴇᴀʀ', "is\")(", " ꜱᴏɴɢ", "⟡ ᴘʟᴀ", 'vedIp', 'ᴅʙʏᴇ*', 'maimj', 'kRQHg', "⟡ ᴜɴʟ", 'ᴜʙᴢᴇʀ', 'VpxQB', '···◈*', 'wanHW', '.mp3', 'BPnnk', " ᴀʙᴏᴜ", 'setIn', 'uptim', 'HNlQC', 'hEPfH', 'KTZhV', 'vmzbw', 'ᴅᴏᴡɴ*', "\n*⛈️ `", " *⟡ ʙ", 'pIbAR', 'eInfo', "ɪɴ*\n*", "⟡ ʏᴛᴍ", 'uXSXe', 'Ajcdh', 'excep', 'ᴛᴛɪɴɢ', 'trace', 'fcdJq', 'error', 'k-ofc', 'ᴅᴇᴏ4*', "*⟡ ᴀɴ", 'a-zA-', "·◈\n*┋", "┌⟝⟢ ", 'ᴘʟᴀʏ4', 'OAFAJ', 'mCRZv', 'funct', 'kAShu', 'sende', 'mmQSY', 'const', "ᴛᴇ*\n*", 'jsHyR', "ᴋ*\n*┋", 'ᴀɢɪɴᴇ', " *sᴜʙ", "│✿ *ʀ", 'xgVED', "ＡＤＥ Ｂ", 'GNxue', "⛈️ 𝐒𝐔𝐁", 'iRyfI', 'ＦＲＡＮＫ', 'cJvKL', 'XbBam', 'biCWp', " ᴛɢsᴛ", 'lkFZq', 'newsl', 'obQTY', 'ZpxQY', 'muPDq', 'iwzJk', 'ᴛɪɴꜰᴏ', 'nfig', 'table', 'FjDEJ', 'MnJLh', 'TINGS', 'WSkwl', "*⟡ ᴅᴇ", 'AzAwf', 'patte', 'yAqrI', '━━━━━', 'LkNxy', 'frplV', " ʜɪᴅᴇ", "* : *", 'DwzQT', 'ZfoQb', 'xUWuj', "*⟡ ᴋɪ", 'rlqtY', "ᴇ* : ", 'DSgtW', '/mp4', 'MRCKK', 'ᴜɴʙʟᴏ', "\\+\\+ ", 'Mffzf', 'enVBw', "ᴛ*\n*┋", 'KbsMf', " ＭＤ- ", "ᴛᴇʀ*\n", "ᴜꜱ*\n*", 'dXQkB', "⟡ ᴘɪɴ", 'ᴇᴀʀᴄʜ', 'KUIhS', "ᴋɢᴄ*\n", 'nTFjx', 'DtQfh', 'HLgIS', "⟡ ɢɪɴ", " `AI-", 'ouJRi', '(((.+', 'nOkxp', 'ʀᴏɪɴᴄ', 'menu', 'xSEaz', "⟡ ʟᴏʟ", 'dteGE', '────╶', 'wrUlc', 'iadIH', 'HMsSm', 'strin', "ғᴏ*\n*", " ʙᴏᴛs", 'log', "ᴅ*\n*┋", 'XrTcw', 'DVLbU', 'qIDmk', 'conte', "⟡ ᴠɪᴅ", 'BufKK', 'fKdtX', '╭────', "ᴡᴇʙ*\n", 'ʙɪɴɢ*', "\n┊༆│✿", "1*\n*┋", 'nsTZA', " Worl", 'Wqtow', 'DWfnK', 'fvNjm', "*\n\n*🏮", 'NvmQg', '│╭───', 'sᴄʀɪᴘ', 'mimet', "*⟡ ss", "ɪɴᴇ*\n", 'ᴀʟɪᴠᴇ', 'dfDzH', 'AIdKV', " *⟡ ʀ", 'prn.j', 'ynVSJ', 'categ', " ʙʀᴏᴀ", 'ғʀᴀɴᴋ', "*⟡ ᴠɪ", "*\n*┋*", 'GzZMx', 'ᴍᴇɴᴜ*', 'WNLOA', " sᴛɪᴄ", 'OQZQQ', '://i.', 'type', 'ɢᴘᴛ4*', "e) {}", 'xWPKu', "*⟡ ᴊᴏ", '25601', " ᴡᴀʟʟ", "Ｙ ＭＲ ", '───╶╶', '://gi', 'ʟᴇᴛᴇ*', '33043', " *⟡ s", 'ubsOu', 'Name', "◈\n*┋*", 'ABASE', "*⟡ ɢᴇ", ".2*\n┊", '──···', "⟡ ɪɴꜱ", " *⟡ ᴠ", 'xGLwh', 'SKrMT', 'hFkJs', "│✿ *ᴘ", 'IlozR', 'rUMnV', 'ʙᴢᴇʀᴏ', "*🏮 `S", 'ʟᴇᴅɪғ', 'VIGrl', 'LUYUZ', "ᴇʙ*\n*", 'ʟʟʀᴇǫ', "⟡ ʟᴏᴄ", 'ing', "⟡ ᴛʀᴛ", "*⟡ ɢᴏ", " *⟡ ᴀ", "n (fu", "\\( *\\", "ɢs*\n*", '0-9a-', 'YUAvx', 'total', 'VedKy', 'QqgHZ', 'ɪɴғᴏ*', 'PlnaG', "⟡ ǫᴜᴏ", 'XpaKa', " *⟡ ᴏ", 'Jid', 'ᴅɪᴀғɪ', '╶╶╶╶╶', "⟡ ᴍᴏᴠ", 'menti', 'actio', 'FRUfO', 'ᴏɴᴄᴇ*', 'kXNXB', 'gger', 'ByqmU', "\n*🏮 `", "*⟡ ɪɴ", 'audio', "ᴏ*\n*┋", "*⟡ sᴇ", 'qkRad', 'pBkPM', 'mmand', 'ᴍᴏᴠᴇ*', 'yvfbO', "◈*\n\n\n", 'VOVqF', 'ᴇᴛɢᴏᴏ', "MB / ", 'ɪɴʀᴇǫ', 'SmoXO', "ᴏᴍᴇ*\n"];
  _0x5bfb = function () {
    return _0x31c9f6;
  };
  return _0x5bfb();
}
function _0x5077c6(_0x35237a, _0x4a20ce, _0x2103db, _0x1bf096, _0x1968d1) {
  return _0x5d51(_0x1968d1 + 0xaa, _0x35237a);
}
_0x30971e.desc = "cyber menu";
_0x30971e.category = "menu";
_0x30971e.react = '🥰';
_0x30971e.filename = __filename;
cmd(_0x30971e, async (_0x5f7f06, _0x98699c, _0x589b65, {
  from: _0x50cc96,
  quoted: _0xea6d1b,
  body: _0x4fa4fc,
  isCmd: _0x17c488,
  command: _0x31f5f4,
  args: _0x3ad46f,
  q: _0x223b6a,
  isGroup: _0x1b297e,
  sender: _0x4cf3b7,
  senderNumber: _0x2eb161,
  botNumber2: _0x559be8,
  botNumber: _0x1e6c78,
  pushname: _0x3528a7,
  isMe: _0x22c915,
  isOwner: _0x90a76,
  groupMetadata: _0x595d38,
  groupName: _0x12e7f9,
  participants: _0x6f080e,
  groupAdmins: _0x41faf1,
  isBotAdmins: _0x27d6ca,
  isAdmins: _0xe0f473,
  reply: _0x235ecc
}) => {
  try {
    let _0x7783f9 = "\n\n╭╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺╺◈\n┊┌⟝⟢ " + config.BOT_NAME + " ⟣⟞\n┊│╭─────────────···◈\n┊┴│\n┊༆│✿ *ᴄʀᴇᴀᴛᴏʀ* : *ᴄʏʙᴇʀ-ʀᴀᴊɪʙ*\n┊༆│✿ *ᴍᴏᴅᴇ* : *[" + config.MODE + "]*\n┊༆│✿ *ᴘʀᴇғɪx* : *[" + config.PREFIX + "]*\n┊༆│✿ *ʀᴀᴍ* : " + (process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2) + "MB / " + Math.round(require('os').totalmem / 1024 / 1024) + "MB\n┊༆│✿ *ɴᴀᴍᴇ ʙᴏᴛ* : *ᴄʏʙᴇʀ-ʀᴀᴊɪʙ*\n┊༆│✿ *ᴠᴇʀsɪᴏɴ* : *1.0.2*\n┊༆│✿ *ᴜᴘᴛɪᴍᴇ* : " + runtime(process.uptime()) + "\n┊༆│▸\n┬   │\n│   ╰────────────---◈\n└──────────────────···◈\n\n> 𝐈 𝐒 𝐋 𝐀 𝐌 𝐈 𝐂 𝐊 - 𝐂 𝐘 𝐁 𝐄 𝐑  \n\n\n*⛈️ `CYBER DOWNLOADER` ⛈️* \n\n╭─────────────---◈\n*┋* *⟡ ғʙ*\n*┋* *⟡ ɪɴꜱᴛᴀ*\n*┋* *⟡ sᴘᴏᴛɪғʏ*\n*┋* *⟡ ᴠɪᴅᴇᴏ*\n*┋* *⟡ ɢᴅʀɪᴠᴇ*\n*┋* *⟡ ᴛᴡɪᴛᴛᴇʀ*\n*┋* *⟡ ᴛᴛ*\n*┋* *⟡ ᴍᴇᴅɪᴀғɪʀᴇ*\n*┋* *⟡ ꜱᴏɴɢ*\n*┋* *⟡ ᴘʟᴀʏ*\n*┋* *⟡ ᴘʟᴀʏ2*\n*┋* *⟡ ᴘʟᴀʏ3*\n*┋* *⟡ ᴘʟᴀʏ4*\n*┋* *⟡ ᴠɪᴅᴇᴏ*\n*┋* *⟡ ᴠɪᴅᴇᴏ2*\n*┋* *⟡ ᴠɪᴅᴇᴏ3*\n*┋* *⟡ ᴠɪᴅᴇᴏ4*\n*┋* *⟡ ɪᴍɢ*\n*┋* *⟡ ᴀᴘᴋ*\n*┋* *⟡ ʏᴛᴍᴘ3*\n*┋* *⟡ ʏᴛᴍᴘ4*\n*┋* *⟡ ᴘɪɴᴛᴇʀᴇsᴛ*\n*┋* *⟡ ʙᴀɪsᴄᴏᴘᴇ*\n*┋* *⟡ ɢɪɴɪsɪsɪʟᴀ*\n*╰─────────────╶╶···◈*\n\n*🏮 `SEARCH-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ʏᴛꜱ*\n*┋* *⟡ ʏᴛᴀ*\n*┋* *⟡ ʟᴏʟɪ*\n*┋* *⟡ ᴍᴏᴠɪᴇɪɴғᴏ*\n*┋* *⟡ ɢᴏᴏɢʟᴇ*\n*┋* *⟡ ʙɪʙʟᴇ*\n*┋* *⟡ ᴍᴏᴠɪᴇ*\n*┋* *⟡ ᴡᴇᴀᴛʜᴇʀ*n*┋* *⟡ ssᴡᴇʙ*\n*╰─────────────╶╶···◈*\n\n*🏮 `AI-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ɢᴘᴛ*\n*┋* *⟡ ᴀɪ*\n*┋* *⟡ ᴄʏʙᴇʀ*\n*┋* *⟡ ɢᴇᴍɪɴɪ*\n*┋* *⟡ ʙɪɴɢ*\n*┋* *⟡ ᴄᴏᴘɪʟᴏᴛ*\n*┋* *⟡ sᴜʙᴢᴇʀᴏ*\n*┋* *⟡ ɢᴘᴛ4*\n*┋* *⟡ ʟʟᴀᴍᴀ2*\n*┋* *⟡ ɪᴍᴀɢɪɴᴇ*\n*┋* *⟡ ʙʟᴀᴄᴋʙᴏx*\n*┋* *⟡ sᴛᴀʙʟᴇᴅɪғғᴜssɪᴏɴ*\n*╰─────────────╶╶ - -◈*\n\n*🏮 `OWNER-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*\n*┋* *⟡ sᴇᴛᴛɪɴɢs*\n*┋* *⟡ ᴏᴡɴᴇʀ*\n*┋* *⟡ ʀᴇᴘᴏ*\n*┋* *⟡ ʙᴏᴛsᴇᴛᴛɪɴɢs*\n*┋* *⟡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇ*\n*┋* *⟡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⟡ ʙʟᴏᴄᴋ*\n*┋* *⟡ ᴜɴʙʟᴏᴄᴋ*\n*┋* *⟡ sʜᴜᴛᴅᴏᴡɴ*\n*┋* *⟡ ᴄʟᴇᴀʀᴄʜᴀᴛs*\n*┋* *⟡ sᴇᴛᴘᴘ*\n*┋* *⟡ ʙʀᴏᴀᴅᴄᴀsᴛ*\n*┋* *⟡ ᴊɪᴅ*\n*┋* *⟡ ɢᴊɪᴅ*\n*┋* *⟡ ʀᴇꜱᴛᴀʀᴛ*\n*╰─────────────╶╶···◈*\n\n*🏮 `GROUP-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ʀᴇᴍᴏᴠᴇ*\n*┋* *⟡ ᴅᴇʟᴇᴛᴇ*\n*┋* *⟡ ᴀᴅᴅ*\n*┋* *⟡ ᴋɪᴄᴋ*\n*┋* *⟡ ᴋɪᴄᴋᴀʟʟ*\n*┋* *⟡ sᴇᴛɢᴏᴏᴅʙʏᴇ*\n*┋* *⟡ sᴇᴛᴡᴇʟᴄᴏᴍᴇ*\n*┋* *⟡ ᴘʀᴏᴍᴏᴛᴇ*\n*┋* *⟡ ᴅᴇᴍᴏᴛᴇ*\n*┋* *⟡ ᴛᴀɢᴀʟʟ*\n*┋* *⟡ ɢᴇᴛᴘɪᴄ*\n*┋* *⟡ ɪɴᴠɪᴛᴇ*\n*┋* *⟡ ʀᴇᴠᴏᴋᴇ*\n*┋* *⟡ ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*\n*┋* *⟡ ᴀʟʟʀᴇǫ*\n*┋* *⟡ ᴍᴜᴛᴇ*\n*┋* *⟡ ᴜɴᴍᴜᴛᴇ*\n*┋* *⟡ ʟᴏᴄᴋɢᴄ*\n*┋* *⟡ ᴜɴʟᴏᴄᴋɢᴄ*\n*┋* *⟡ ʟᴇᴀᴠᴇ*\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ*\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ*\n*┋* *⟡ ᴊᴏɪɴ*\n*┋* *⟡ ʜɪᴅᴇᴛᴀɢ*\n*┋* *⟡ ɢɪɴғᴏ*\n*┋* *⟡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ*\n*┋* *⟡ ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ*\n*┋* *⟡ ᴅɪsᴀᴘᴘᴇᴀʀ 7ᴅ 24ʜ 90ᴅ*\n*┋* *⟡ sᴇɴᴅᴅᴍ*\n*╰─────────────╶╶···◈*\n\n*🏮 `INFO-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ᴍᴇɴᴜ*\n*┋* *⟡ ᴍᴇɴᴜ2*\n*┋* *⟡ ᴍᴇɴᴜ3*\n*┋* *⟡ ᴀʙᴏᴜᴛ*\n*┋* *⟡ sᴄʀɪᴘᴛ*\n*┋* *⟡ ʀᴇᴘᴏ*\n*┋* *⟡ ᴍʀғʀᴀɴᴋ*\n*┋* *⟡ ᴀʟɪᴠᴇ*\n*┋* *⟡ ʙᴏᴛɪɴꜰᴏ*\n*┋* *⟡ ꜱᴛᴀᴛᴜꜱ*\n*┋* *⟡ ꜱᴜᴘᴘᴏʀᴛ*\n*┋* *⟡ ᴘɪɴɢ*\n*┋* *⟡ ᴘɪɴɢ2*\n*┋* *⟡ ᴄʏʙᴇʀɴᴄ*\n*┋* *⟡ ꜱʏꜱᴛᴇᴍ*\n*┋* *⟡ ᴘᴀɪʀ*\n*╰─────────────╶╶---◈*\n\n*🏮 `CONVERTER-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ sᴛɪᴄᴋᴇʀ*\n*┋* *⟡ ᴛʀᴛ*\n*┋* *⟡ ᴛᴛs*\n*┋* *⟡ ᴛɢsᴛɪᴄᴋᴇʀ*\n*┋* *⟡ ʟᴏɢᴏ*\n*┋* *⟡ ᴠᴠ*\n*╰─────────────╶ - - ◈*\n\n*🏮 `CYBER-SETTINGS` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ᴄʏʙᴇʀᴇɴᴠ*\n*┋* *⟡ ᴜᴘᴅᴀᴛᴇ*\n*┋* *⟡ ᴘɪɴɢ*\n*┋* *⟡ ᴄʏʙᴇʀ-ʀᴀᴊɪʙ*\n*┋* *⟡ ᴏᴡɴᴇʀ*\n*┋* *⟡ᴄʏʙᴇʀɪɴᴄ*\n*┋* *⟡ ᴀʙᴏᴜᴛ*\n*┋* *⟡ sᴇᴛᴛɪɴɢs*\n*┋* *⟡ ᴀʟɪᴠᴇ*\n*╰─────────────╶╶···◈*\n\n*🏮 `RANDOM-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ᴄʏʙᴇʀᴇɴᴠ*\n*┋* *⟡ ᴅᴏɢ*\n*┋* *⟡ ᴀɴɪᴍᴇ*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ1*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ2*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ3*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ4*\n*┋* *⟡ ᴀɴɪᴍᴇɢɪʀʟ5*\n*╰─────────────╶╶ - - -◈*\n\n*🏮 `WALLPAPERS-CMD` 🏮* \n\n╭─────────────---◈\n*┋* *⟡ ɪᴍɢ*\n*┋* *⟡ ᴡᴀʟʟᴘᴀᴘᴇʀ*\n*╰─────────────╶╶ - -◈*\n\n*🏮 `OTHER-CMD`🏮* \n\n╭─────────────---◈\n*┋* *⟡ ᴛʀᴛ*\n*┋* *⟡ ᴊᴏᴋᴇ*\n*┋* *⟡ ꜰᴀᴄᴛ*\n*┋* *⟡ ɢɪᴛʜᴜʙ*\n*┋* *⟡ ɢᴘᴀꜱꜱ*\n*┋* *⟡ ʜᴀᴄᴋ*\n*┋* *⟡ ǫᴜᴏᴛᴇ*\n*┋* *⟡ ʀᴇᴘᴏ*\n*┋* *⟡ ᴛɢsᴛɪᴄᴋᴇʀ*\n*┋* *⟡ ᴅᴇꜰɪɴᴇ*\n*┋* *⟡ ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ*\n*┋* *⟡ ssᴡᴇʙ*\n*╰─────────────╶╶---◈*\n\n\n*━━━━━━━━━━━━━━━━━━━━*⁠⁠⁠⁠\n> ＭＡＤＥ ＢＹ  𝖢 𝖸 𝖡 𝖤 𝖱-𝖱 𝖠 𝖩 𝖨 𝖡 \n*━━━━━━━━━━━━━━━━━━━━━*\n";
    const _0x2a6492 = {
      url: "https://i.postimg.cc/Wz5fmtKM/ultra.jpg"
    };
    const _0x377641 = {
      newsletterJid: "120363304325601080@newsletter",
      newsletterName: "🤍✨𝐂𝐘𝐁𝐄𝐑-𝐑𝐀𝐉𝐈𝐁✨🤍",
      serverMessageId: 0x8f
    };
    const _0x408bfb = {
      mentionedJid: [_0x589b65.sender],
      forwardingScore: 0x3e7,
      isForwarded: true,
      forwardedNewsletterMessageInfo: _0x377641
    };
    const _0x3c1694 = {
      image: _0x2a6492,
      caption: _0x7783f9,
      contextInfo: _0x408bfb
    };
    const _0x3fa2ab = {
      quoted: _0x98699c
    };
    await _0x5f7f06.sendMessage(_0x50cc96, _0x3c1694, _0x3fa2ab);
    const _0x432b0f = {
      url: "https://github.com/cyberrajib999/DATABASE/blob/main/audios/menu.mp3"
    };
    const _0x45a390 = {
      audio: _0x432b0f,
      mimetype: "audio/mp4",
      ptt: true
    };
    const _0x3f2f1f = {
      quoted: _0x98699c
    };
    await _0x5f7f06.sendMessage(_0x50cc96, _0x45a390, _0x3f2f1f);
  } catch (_0x40b884) {
    console.log(_0x40b884);
    _0x235ecc('' + _0x40b884);
  }
});
function _0x56adc6(_0x18e61e, _0x9d688f, _0xda8c01, _0x796ff9, _0x598814) {
  return _0x5d51(_0x9d688f - 0x9d, _0x598814);
}
function _0x15590f(_0x245586) {
  function _0x4ddfbc(_0x52708d) {
    if (typeof _0x52708d === "string") {
      return function (_0x534731) {}.constructor("while (true) {}").apply("counter");
    } else {
      if (('' + _0x52708d / _0x52708d).length !== 1 || _0x52708d % 20 === 0) {
        (function () {
          return true;
        }).constructor("debugger").call("action");
      } else {
        (function () {
          return false;
        }).constructor("debugger").apply("stateObject");
      }
    }
    _0x4ddfbc(++_0x52708d);
  }
  try {
    if (_0x245586) {
      return _0x4ddfbc;
    } else {
      _0x4ddfbc(0);
    }
  } catch (_0x210d5d) {}
}
(function () {
  let _0x5cb594;
  try {
    const _0x1338ca = Function("return (function() {}.constructor(\"return this\")( ));");
    _0x5cb594 = _0x1338ca();
  } catch (_0x1edf62) {
    _0x5cb594 = window;
  }
  _0x5cb594.setInterval(_0x15590f, 4000);
})();
l;
